validation_case/analytical_heat_pimple/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cyclicHeatPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      10;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

// ************************************************************************* //
functions
{
    // probes
    // {
    //     type            probes;
    //     libs            (sampling);

    //     // Name of the directory for probe data
    //     name            probes;

    //     // Write at same frequency as fields
    //     writeControl    outputTime;
    //     writeInterval   1;

    //     // Fields to be probed
    //     fields          (p U T);

    //     // Optional: interpolation scheme to use (default is cell)
    //     interpolationScheme cell;

    //     probeLocations
    //     (
    //         (0.0 0.017 0.0)
    //         (0.0 -0.017 0.0)
    //         (-0.017 0.0 0.0)
    //         (0.017 0.0 0.0)
    //     );

    //     includeOutOfBounds  false;
    // }

    // mass
    // {
    //     type            volFieldValue;
    //     libs            (fieldFunctionObjects);

    //     writeControl    outputTime;
    //     writeInterval   1;
    //     writeFields     false;
    //     log             true;

    //     operation       volIntegrate;
    //     // postOperation   mag;

    //     fields
    //     (
    //         rho
    //     );
    // }
}
