validation_case/analytical_heat_pimple/constant/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../0.orig/include/initialConditions"

momentumSource
{
    type            patchMeanVelocityForce;
    active          yes;

    patchMeanVelocityForceCoeffs
    {
        selectionMode   all;
        patch           inlet;
        fields          (U);
        Ubar            $flowUbar;
        relaxation      0.8;
    }
}


// ************************************************************************* //
