validation_case/analytical_heat_pimple/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../0/include/initialConditions"

transportModel  Newtonian;

// Laminar viscosity
nu              $flowNu;

// Thermal expansion coefficient
beta            $thermalBeta;

// Reference temperature
TRef            $bulkTemp;

// Laminar Prandtl number
Pr              $regularPr;

// Turbulent Prandtl number
Prt             $turbulentPr;

// ************************************************************************* //
