validation_case/analytical_heat_pimple/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "include/initialConditions"

internalField   $flowVelocity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "wall.*"
    {
        type            noSlip;
    }

    // "(ymax|ymin)"
    // {
    //     type            noSlip;
    // }

    // "(xmax|xmin)"
    // {
    //     type            noSlip;
    // }

    #include "include/constantPatches"
}


// ************************************************************************* //
