validation_case/analytical_heat_pimple/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include "include/initialConditions"

internalField   $flowEpsilon;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "wall.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    // "(ymax|ymin)"
    // {
    //     type            epsilonWallFunction;
    //     value           $internalField;
    // }

    // "(xmax|xmin)"
    // {
    //     type            epsilonWallFunction;
    //     value           $internalField;
    // }
    
    #include "include/constantPatches"
}


// ************************************************************************* //
