validation_case/analytical_heat_pimple/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

#include "include/initialConditions"

internalField   $flowOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    "wall.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }    

    // "(ymax|ymin)"
    // {
    //     type            omegaWallFunction;
    //     value           $internalField;
    // }    

    // "(zmax|zmin)"
    // {
    //     type            omegaWallFunction;
    //     value           $internalField;
    // } 

    #include "include/constantPatches" 
}

// ************************************************************************* //
